Javascript Allonge Notepad

***** Ex:
  #+BEGIN_SRC js
    return () => 0
  #+END_SRC

  #+RESULTS:
  | Function |

***** Ex:
  #+BEGIN_SRC js
    return (() => 0 )()
  #+END_SRC

  #+RESULTS:
  : 0

***** Ex:
 #+BEGIN_SRC js
   return () => {2 + 2}
 #+END_SRC

 #+RESULTS:
 | Function |

***** Ex:
 #+BEGIN_SRC js
  return (() => { return 2+2; })()  
 #+END_SRC

 #+RESULTS:
 : 4

***** Ex:
#+BEGIN_SRC js
  return ((x) => (y) => x)(1)(2)
#+END_SRC

#+RESULTS:
: 1

***** ex: 
#+BEGIN_SRC js
  return ((pi) => (diameter) => diameter * pi)(3.14)(10)
#+END_SRC

#+RESULTS:
: 31.400000000000002

***** Ex:
#+BEGIN_SRC js
  return ((diameter) => ((pi) => diameter * pi)(3.14))(10)
#+END_SRC

#+RESULTS:
: 31.400000000000002

*** Example:

#+BEGIN_SRC js
const callFirst = (fn, larg) =>
  function (rest) {
  return fn.call(this, larg, rest);
};

const greet = (me, you) =>
  `Hello, ${you}, my name is ${me}`;
 
const heliosSaysHello = callFirst(greet, 'Helios');

console.log(heliosSaysHello('Celine'));

#+END_SRC

#+RESULTS:
: Hello, Celine, my name is Helios
: undefined

*** Example:

#+BEGIN_SRC js
const unary = (fn) =>
   fn.length === 1
     ? fn
     : function (something) {
         return fn.call(this, something);
};
console.log(['1', '2', '3'].map(unary(parseInt)));
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

*** Application Example:

#+BEGIN_SRC js
const tap = (value) =>
 (fn) => (
   typeof(fn) === 'function' && fn(value),
     value
   );

tap('espresso')(it => {
  console.log(`Our drink is '${it}'`);
});
#+END_SRC

#+RESULTS:
: Out drink is 'espresso'
: undefined

*** Example:

#+BEGIN_SRC js
'use strict'
const once = (fn) => {
  let done = false;
 
  return function () {
    return done ? void 0 : ((done = true), fn.apply(this, arguments))
  }
};

const askedOnABlindDate = once(
  () => 'sure'
);

console.log(askedOnABlindDate());
console.log(askedOnABlindDate());
console.log(askedOnABlindDate());
console.log(askedOnABlindDate());

#+END_SRC

#+RESULTS:
: sure
: undefined
: undefined
: undefined
: undefined

*** Example:
    
#+BEGIN_SRC js
const leftVariadic = (fn) => {
  if (fn.length < 1) {
    return fn;
  } else {
    return function (args) {
      const gathered = args.slice(0, args.length - fn.length + 1), spread = args.slice(args.length - fn.length + 1);
      return fn.apply(
        this, [gathered].concat(spread)
      ); }
    } 
};

const butLastAndLast = leftVariadic((butLast, last) => [butLast, last]);
console.log(butLastAndLast(['why', 'hello', 'there', 'little', 'droid']));
#+END_SRC

#+RESULTS:
| (why hello there little) | droid |

**** Recipe:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
'use strict'
const [first, ...butFirst] = ['why', 'hello', 'there', 'little', 'droid'];
console.log(butFirst);
console.log(first); 
#+END_SRC

#+RESULTS:
: [ 'hello', 'there', 'little', 'droid' ]
: why

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
const leftGather = (outputArrayLength) => { 
  return function (inputArray) {
    return [inputArray.slice(0, 
            inputArray.length - outputArrayLength + 1)]
           .concat(
             inputArray.slice(inputArray.length - outputArrayLength + 1)
           )
    } 
};

const [butLast, last] = leftGather(2)(['why', 'hello', 'there', 'little', 'droid']);
console.log(butLast);
console.log(last);

#+END_SRC  

#+RESULTS:
: [ 'why', 'hello', 'there', 'little' ]
: droid

     
*** Example:
 
#+BEGIN_SRC js
  const compose = (a, b) =>
    (c) => a(b(c))

  const addOne = (number) => number + 1;
  const doubleOf = (number) => number * 2;
  const doubleOfAddOne = compose(doubleOf, addOne);

  console.log(doubleOfAddOne(3));

#+END_SRC

#+RESULTS:
: 8
: undefined

*** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" 
  const pipeline = (...fns) => 
    (value) =>
      fns.reduce((acc, fn) => fn(acc), value); 

  const addOne = (number) => number + 1;
  const double = (number) => number * 2;
  const setter = pipeline(addOne, double);

console.log(setter(2));
#+END_SRC

#+RESULTS:
: 6
: undefined


***** Example:

#+BEGIN_SRC js
  const x = [], a = [x];
  console.log(a[0] === x);

#+END_SRC

#+RESULTS:
: true
: undefined

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"
// declare
  const container = ['goodies'];
// destructure
  const unwrap = (wrapped) => { 
    const [something] = wrapped;
    return something; 
  }
  console.log(unwrap(container));

#+END_SRC

#+RESULTS:
: goodies
: undefined

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const [car, ...cdr] = [1, 2, 3, 4, 5];
  console.log(car);
  console.log(cdr);
#+END_SRC

#+RESULTS:
: 1
: [ 2, 3, 4, 5 ]
**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"
  const oneTwoThree = ['one', 'two', 'three'];
  console.log(['zero', ...oneTwoThree]);

#+END_SRC

#+RESULTS:
| zero | one | two | three |

***** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"
  const [thistle, that, theOther] = ['duck feet', 'tiger tail'];
  console.log(theOther);

  const [...what] = [];
  console.log(what);

#+END_SRC

#+RESULTS:
: undefined
: []
: undefined

***** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const description = (nameAndOccupation) => { 
    if (nameAndOccupation.length < 2) {
      return ["", "occupation missing"] 
    } else {
      const [[first, last], occupation] = nameAndOccupation;
      return [`${first} is a ${occupation}`, "ok"];
    }
  }

  const [reg, status] = description([["Reginald", "Braithwaite"], "programmer"]);

  console.log(reg);
  console.log(status);
#+END_SRC

#+RESULTS:
: Reginald is a programmer
: ok

***** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
 const theWholeShebang = (car, ...cdr) => [car, cdr];
 console.log(theWholeShebang('why', 'hello', 'there', 'little', 'droid'));

#+END_SRC

#+RESULTS:
: [ 'why', [ 'hello', 'there', 'little', 'droid' ] ]


*** A process to determing whether a value is an empty list:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const isEmpty = ([first, ...rest]) => first === undefined; 

  console.log(isEmpty([]));
  console.log(isEmpty([0]));
  console.log(isEmpty([[]]));

#+END_SRC

#+RESULTS:
: true
: false
: false

*** A recursive process to determine the length of an array

 #+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

   const length = ([first, ...rest]) =>
     first === undefined 
       ? 0
       : 1 + length(rest);

   console.log(length([]));
   console.log(length([1,2,3]));

 #+END_SRC

 #+RESULTS:
 : 0
 : 3
*** Flatten-ing

#+BEGIN_SRC  js :cmd "org-babel-node --presets es2015" :results output

  const flatten = ([first, ...rest]) => {
    if (first === undefined) {
      return [];
    } else if (!Array.isArray(first)) {
      return [first, ...flatten(rest)];
    } else {
      return [...flatten(first), ...flatten(rest)];
    }
}

console.log(flatten(['foo', [3, 4, []]]));

#+END_SRC

#+RESULTS:
: [ 'foo', 3, 4 ]

**** sumSquares Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const sumSquares = ([first, ...rest]) => 
    first === undefined 
      ? 0
      : first * first + sumSquares(rest);

  console.log(sumSquares([1,2,3]));

#+END_SRC

#+RESULTS:
: 14

**** foldWith, a moar general mapWith:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const foldWith = (fn, terminalValue, [first, ...rest]) => 
    first === undefined
      ? terminalValue
      : fn(first, foldWith(fn, terminalValue, rest));

  console.log(foldWith((x, rest) => x * x + rest, 0, [1,2,3]));

#+END_SRC

#+RESULTS:
: 14

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const foldWith = (fn, terminalValue, [first, ...rest]) => 
    first === undefined
      ? terminalValue
      : fn(first, foldWith(fn, terminalValue, rest));

  const mapWith = (fn, array) => 
    foldWith((first, rest) => [fn(first), ...rest], [], array);

  const squareAll = (array) => mapWith((x) => x * x, array);

  console.log(squareAll([1,2,3,4,5]));

#+END_SRC

#+RESULTS:
: [ 1, 4, 9, 16, 25 ]

  
**** Length Example:
    
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"


  const lengthTCO = ([first, ...rest], counter) => 
    first === undefined
      ? counter
      : lengthTCO(rest, 1 + counter);

  const callLast = (fn, ...args) =>
    (...moarArgs) =>
      fn(...moarArgs, ...args);

  const length = callLast(lengthTCO, 0);

  console.log(length(['how', 'now', 'brown', 'cow']));

#+END_SRC

#+RESULTS:
: 4
: undefined

**** Factorial Example

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"


  const factorialTCO = (num, product) => 
    num === 1
      ? product
      : factorialTCO(num - 1, num * product);

  const callLast = (fn, ...args) =>
    (...moarArgs) =>
      fn(...moarArgs, ...args);

  const factorial = callLast(factorialTCO, 1);

  console.log(factorial(5));

#+END_SRC

#+RESULTS:
: 120
: undefined

**** Example:
     
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const factorial = (n, work = 1) =>
    n === 1
      ? work
      : factorial(n - 1, n * work)

  console.log(factorial(5));

#+END_SRC

#+RESULTS:
: 120

**** Length and mapWith Examples:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output
  const length = ([first, ...rest], numberToBeAdded = 0) =>
    first === undefined
      ? numberToBeAdded
      : length(rest, 1 + numberToBeAdded)
 
  console.log(length(["foo", "bar", "baz"]));

  const mapWith = (fn, [first, ...rest], prepend = []) =>
    first === undefined
      ? prepend
      : mapWith(fn, rest, [...prepend, fn(first)]);

  console.log(mapWith((x) => x * x, [1, 2, 3, 4, 5]));

#+END_SRC

#+RESULTS:
: 3
: [ 1, 4, 9, 16, 25 ]

**** Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const [first, second = "two"] = ["one"];
  console.log(`${first} . ${second}`);

  const [third, fourth = "two"] = ["primus", "secundus"]; 
  console.log(`${third} . ${fourth}`);

#+END_SRC

#+RESULTS:
: one . two
: primus . secundus


*** Three different ways to store functions:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const combinator = {
    idiotBird : function (x) {
      return x;
    },
    kestrel : function kestrel (x) {
      return (y) => (x);
    },
    blackBird (a, b) {
     return (c) => a(b(c));
    }
  }

  var bigBird = combinator.blackBird(combinator.kestrel, combinator.idiotBird)(3);

  console.log(bigBird());

#+END_SRC

#+RESULTS:
: 3
: undefined

**** Literal Destructuring:
     
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const knight = {
    name: {
      first: 'Matthew',
      last: 'Hoselton'
    },
    quest: 'to seek the Y combinator',
    color: 'blue'
  }

  const {name: {first: given, last: surname}, quest, color} = user;

  console.log(given + ' ' + surname);

#+END_SRC

#+RESULTS:
: Matthew Hoselton
: undefined

**** Destructuring Parameters:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const knight = {
    name: {
      first: 'Matthew',
      last: 'Hoselton'
    },
    quest: 'to seek the Y combinator',
    color: 'blue'
  }

  const description = ({name: {first: given, last: surname}, quest, color}) =>
   `Sir ${surname} is on a quest ${quest}`

  console.log(description(knight));

#+END_SRC

#+RESULTS:
: Sir Hoselton is on a quest to seek the y combinator
: undefined

**** Sugar (for when the object key is a valid variable name):

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const knight = {
    name: {
      first: 'Matthew',
      last: 'Hoselton'
    },
    quest: 'to seek the Y combinator',
    color: 'blue'
  }

  const description = ({name: {first, last}, quest, color}) =>
   `Sir ${last} is on a quest ${quest}`

  console.log(description(knight));

#+END_SRC

#+RESULTS:
: Sir Hoselton is on a quest to seek the Y combinator
: undefined

**** Object Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = { first: 1, 
                        rest: { 
                          first: 2,
                          rest: { 
                            first: 3, 
                            rest: EMPTY  
                          }
                        }
                      };

  console.log(oneTwoThree.first);
  console.log(oneTwoThree.rest);

#+END_SRC

#+RESULTS:
: 1
: { first: 2, rest: { first: 3, rest: {} } }

**** Length Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const length = (node, counter = 0) =>
    node === EMPTY
      ? counter
      : length(node.rest, counter + 1)

  console.log(length(oneTwoThree));

#+END_SRC

#+RESULTS:
: 3

**** Slow Copy Example:
     
#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const slowcopy = (node) => 
    node === EMPTY
      ? EMPTY
      : { first: node.first, rest: slowcopy(node.rest)};

  console.log(slowcopy(oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 1, rest: { first: 2, rest: { first: 3, rest: {} } } }

**** Reverse Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const reverse = (node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverse(node.rest, {first: node.first, rest: delayed});

  console.log(reverse(oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 3, rest: { first: 2, rest: { first: 1, rest: {} } } }

**** reverseMap Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const reverseMap = (fn, node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverseMap(fn, node.rest, {first: fn(node.first), rest: delayed});

  console.log(reverseMap((x) => x * x, oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 9, rest: { first: 4, rest: { first: 1, rest: {} } } }

**** Map Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015" :results output

  const EMPTY = {};
  const oneTwoThree = {first: 1, rest: {first: 2, rest: {first: 3, rest: EMPTY}}};

  const reverse = (node, delayed = EMPTY) => 
    node === EMPTY
      ? delayed
      : reverse(node.rest, {first: node.first, rest: delayed});

  const map = (fn, node, delayed = EMPTY) => 
    node === EMPTY
      ? reverse(delayed)
      : map(fn, node.rest, {first: fn(node.first), rest: delayed});

  console.log(map((x) => x * x, oneTwoThree));

#+END_SRC

#+RESULTS:
: { first: 1, rest: { first: 4, rest: { first: 9, rest: {} } } }

*** Mutation Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const allHallowsEve = [2012, 10, 31];
  (function (halloween) {
    halloween[0] = 2013;
  })(allHallowsEve);

  console.log(allHallowsEve);

#+END_SRC

#+RESULTS:
| 2013 | 10 | 31 |

*** moar simple mutation example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

  const allHallowsEve = [2012, 10, 31];
  const halloween = allHallowsEve;
  halloween[0] = 2013;
  console.log(allHallowsEve);

#+END_SRC

#+RESULTS:
| 2013 | 10 | 31 |

**** Map Example:

#+BEGIN_SRC js :cmd "org-babel-node --presets es2015"

const EMPTY = {};
const OneToFive = {first: 1,
                   rest: {
                     first: 2,
                     rest: {
                       first: 3,
                       rest: {
                         first: 4,
                         rest: {
                           first: 5,
                           rest: EMPTY }}}}};

  const mapWith = (fn, node, head = null, tail = null) => {
    if (node === EMPTY) {
      return head; 
    } else if (tail === null) {
      const { first, rest } = node;
      const newNode = { first: fn(first), rest };
      return mapWith(fn, rest, newNode, newNode);
    } else {
      const { first, rest } = node;
      const newNode = { first: fn(first), rest };
      tail.rest = newNode;
      return mapWith(fn, node.rest, head, newNode);
    }
  }

console.log(mapWith((x) => 1.0 / x, OneToFive));

#+END_SRC

#+RESULTS:
: { first: 1,
:   rest: 
:    { first: 0.5,
:      rest: { first: 0.3333333333333333, rest: [Object] } } }
: undefined


